但  人  不  轉      起  我  不  明                  水  
願  有  應  朱      舞  欲  知  月                  調  
人  悲  有  閣      弄  乘  天  幾                  歌  
長  歡  恨          清  風  上  時                  頭  
久  離      低      影  歸  宮  有                      
    合  何  綺          去  闕                          
千      事  戶      何          把                      
里  月  長          似  危  今  酒      作  丙          
共  有  向  照      在  恐  夕  問      此  辰          
嬋  陰  別  無      人  瓊  是  青      篇  中          
娟  晴  時  眠      間  樓  何  天          秋          
    圓  圓              玉  年          兼              
    缺                  宇              懷  歡          
                                        子  飲          
    此                  高              由  達          
    事                  處                  旦          
    古                  不                              
    難                  勝                  大      蘇  
    全                  寒                  醉      軾  
