> 依姓名排序 [小->大] 
姓名 :    Amy [F]     年齡 : 10
姓名 :  Grace [F]     年齡 : 18
姓名 :   John [M]     年齡 : 13
姓名 :   Mary [F]     年齡 : 10
姓名 :   Tony [M]     年齡 : 17

> 依年齡排序 (使用內定排序方式[小->大]) 
姓名 :    Amy [F]     年齡 : 10
姓名 :   Mary [F]     年齡 : 10
姓名 :   John [M]     年齡 : 13
姓名 :   Tony [M]     年齡 : 17
姓名 :  Grace [F]     年齡 : 18

> 依性別排序 [大->小] 
姓名 :   John [M]     年齡 : 13
姓名 :   Tony [M]     年齡 : 17
姓名 :    Amy [F]     年齡 : 10
姓名 :   Mary [F]     年齡 : 10
姓名 :  Grace [F]     年齡 : 18

> 依下列方式順序排序
  (1) 性別 [小->大] (2) 年齡 [大->小] (3) 姓名 [小->大]
姓名 :  Grace [F]     年齡 : 18
姓名 :    Amy [F]     年齡 : 10
姓名 :   Mary [F]     年齡 : 10
姓名 :   Tony [M]     年齡 : 17
姓名 :   John [M]     年齡 : 13

