> 姓名 : 宋遠橋     性別 : 男     出生 : 1923/4/8
  學號 : 000001     入學 : 1943/9
  住址 : 中壢市
  電話 : 0937123456

> 姓名 : 俞蓮舟     性別 : 男     出生 : 1927/1/26
  學號 : 000002     入學 : 1946/6
  住址 : 缺
  電話 : 缺

> 姓名 : 俞岱巖     性別 : 男     出生 : 1930/2/3
  學號 : 000003     入學 : 1950/1
  住址 : 新竹市
  電話 : 0931123456

> 姓名 : 張松溪     性別 : 男     出生 : 1934/11/25
  學號 : 000004     入學 : 1952/3
  住址 : 缺
  電話 : 缺

> 姓名 : 張翠山     性別 : 男     出生 : 1939/12/12
  學號 : 000005     入學 : 1956/9
  住址 : 台南市
  電話 : 0926123456

> 姓名 : 殷梨亭     性別 : 男     出生 : 1945/4/3
  學號 : 000006     入學 : 1959/6
  住址 : 台北市
  電話 : 0938654321

> 姓名 : 莫聲谷     性別 : 男     出生 : 1950/7/18
  學號 : 000007     入學 : 1962/11
  住址 : 缺
  電話 : 0939234567

