/*======================================================
// 函数名：lagr
// 功能描述：拉盖尔-高斯求积法进行积分
// 输入参数：a 积分的下限
//           f 指向被积函数的指针
//           p 积分方向。p=1则积分[a,inf)，p=-1则积分(-inf,a];
// 返回值：  积分近似值
=========================================================*/
#include "math.h"

double lagr(a, f, p)
double a, (*f)();
int p;
{
    int i;
    double z;                                   /* 5阶拉盖尔多项式的零点*/
    static double t[5] = {0.2635608366230711, 1.413402992130087,
                          3.5964257647443034, 7.08581000836623, 12.640800845980232
                         };
    static double c[5] = {0.679094868860246, 1.638485827229450,
                          2.769447700914552, 4.315635380726091, 7.219514571190223
                         };
    z = 0.0;

    if (p > 0)
        for (i = 0; i < 5; i++) {                    /* 求解积分值*/
            z = z + c[i] * (*f)(a + t[i]);
        }
    else
        for (i = 0; i < 5; i++) {
            z = z + c[i] * (*f)(a - t[i]);
        }

    return (z);
}
