> 3652422/295306 = [12;2,1,2,1,1,16,1,5,2,6,2,2] 的漸近分數 : 
[ 1]           12/1    [ 2]           25/2    [ 3]           37/3    
[ 4]           99/8    [ 5]         136/11    [ 6]         235/19    
[ 7]       3896/315    [ 8]       4131/334    [ 9]     24551/1985    
[10]     53233/4304    [11]   343949/27809    [12]   741131/59922    
[13] 3652422/295306    

> 漸近分數所產生的閏月數 : 
[ 1] 每      1 年      0 個閏月，陰曆平均每年比陽曆少 15660.000000 分鐘
[ 2] 每      2 年      1 個閏月，陰曆平均每年比陽曆多  5602.032000 分鐘
[ 3] 每      3 年      1 個閏月，陰曆平均每年比陽曆少  1485.312000 分鐘
[ 4] 每      8 年      3 個閏月，陰曆平均每年比陽曆多   286.524000 分鐘
[ 5] 每     11 年      4 個閏月，陰曆平均每年比陽曆少   196.704000 分鐘
[ 6] 每     19 年      7 個閏月，陰曆平均每年比陽曆多     6.760421 分鐘
[ 7] 每    315 年    116 個閏月，陰曆平均每年比陽曆少     0.344686 分鐘
[ 8] 每    334 年    123 個閏月，陰曆平均每年比陽曆多     0.059497 分鐘
[ 9] 每   1985 年    731 個閏月，陰曆平均每年比陽曆少     0.004643 分鐘
[10] 每   4304 年   1585 個閏月，陰曆平均每年比陽曆多     0.000335 分鐘
[11] 每  27809 年  10241 個閏月，陰曆平均每年比陽曆少     0.000021 分鐘
[12] 每  59922 年  22067 個閏月，陰曆平均每年比陽曆多     0.000005 分鐘
[13] 每 295306 年 108750 個閏月，陰曆平均每年比陽曆少     0.000000 分鐘
