> 歡迎使用個人專用虛擬郵局, 請選擇以下服務項目
  [1] 存款交易    [2] 提款交易    [3] 列印明細    [4] 離開
> 1
> 輸入日期與金額 : 2001-1-23 1000
  日期          註解           存款           提款           餘額
2001-01-23                  1000.00                       1000.00

> 歡迎使用個人專用虛擬郵局, 請選擇以下服務項目
  [1] 存款交易    [2] 提款交易    [3] 列印明細    [4] 離開
> 1
> 輸入日期與金額 : 2001-5-30 2000
  日期          註解           存款           提款           餘額
2001-05-30                  2000.00                       3000.00

> 歡迎使用個人專用虛擬郵局, 請選擇以下服務項目
  [1] 存款交易    [2] 提款交易    [3] 列印明細    [4] 離開
> 2
> 輸入日期與金額 : 2002-3-5 1000
  日期          註解           存款           提款           餘額
2001-07-01      利息          26.30                       3026.30
2002-01-01      利息         152.56                       3178.86
2002-03-05                                -1000.00        2178.86

> 歡迎使用個人專用虛擬郵局, 請選擇以下服務項目
  [1] 存款交易    [2] 提款交易    [3] 列印明細    [4] 離開
> 3
  日期          註解           存款           提款           餘額
2001-01-23                  1000.00                       1000.00
2001-05-30                  2000.00                       3000.00
2001-07-01      利息          26.30                       3026.30
2002-01-01      利息         152.56                       3178.86
2002-03-05                                -1000.00        2178.86

> 歡迎使用個人專用虛擬郵局, 請選擇以下服務項目
  [1] 存款交易    [2] 提款交易    [3] 列印明細    [4] 離開
> 4
