     Mon           Tue           Wed           Thu           Fri           
1                  微積分        物理                                      
2                  微積分        物理                                      
3    國文                                      微積分                      
4    國文                                      微積分                      
5                  國文          哲學概論                                  
6    計算機概論                  哲學概論                    英文          
7    計算機概論    認識星空                    物理          英文          
8    計算機概論    認識星空                    物理          英文          
