> 輸入詩人名字 : 李白

李白                                    勞勞亭
天下傷心事  勞勞送客亭  春風知別苦  不遣柳條青

李白                                    秋浦歌
白髮三千丈  離愁似個長  不知明鏡裡  何處得秋霜

李白                                  夜宿山寺
危樓高百尺  手可摘星辰  不敢高聲語  恐驚天上人

李白                                      夜思
床前明月光  疑是地上霜  舉頭望明月  低頭思故鄉

李白                                                    贈汪倫
李白乘舟將欲行  忽聞岸上踏歌聲  桃花潭水深千尺  不及汪倫送我情

李白                                                望盧山瀑布
日照香爐生紫煙  遙看瀑布掛前川  飛流直下三千尺  疑是銀河落九天

李白                                            送孟浩然之廣陵
故人西辭黃鶴樓  煙花三月下揚州  孤帆遠影碧空盡  惟見長江天際流

> 輸入詩人名字 : 王維

王維                                      鹿柴
空山不見人  但聞人語響  返景入深林  復照青苔上

王維                                    鳥鳴澗
人閒桂花落  夜靜春山空  月出驚山鳥  時鳴春澗中

王維                                      雜詩
君自故鄉來  應知故鄉事  來日綺窗前  寒梅著花未

> 輸入詩人名字 : 
